In [7]:
# !pip install pymysql

In [8]:
# !pip install jupyterthemes

In [9]:
# !jt -l

In [10]:
# !jt -t chesterish

In [19]:
import pymysql.cursors

# Connect to the database
connection = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             database='test',
                             cursorclass=pymysql.cursors.DictCursor)

with connection:
    with connection.cursor() as cursor:
        
        username = "vincent"
        name = "vincent mancini"
        age = 34
        nation = "Italia"
        
        # Create a new record
        sql = f'INSERT INTO `users` (username, name, age, nation) VALUES ("{username}", "{name}", "{age}", "{nation}")'
        print(sql)
        cursor.execute(sql)

    # connection is not autocommit by default. So you must commit to save
    # your changes.
    connection.commit()

INSERT INTO `users` (username, name, age, nation) VALUES ("vincent", "vincent mancini", "34", "Italia")

In [22]:
# import pymysql.cursors

# # Connect to the database
# connection = pymysql.connect(host='localhost',
#                              user='root',
#                              password='',
#                              database='test',
#                              cursorclass=pymysql.cursors.DictCursor)

# with connection:
#     with connection.cursor() as cursor:
        
#         username = "vincent"
#         name = "vincent mancini"
#         age = 34
#         nation = "Italia"
        
#         for i in range(30):
#             # Create a new record
#             sql = f'INSERT INTO `users` (username, name, age, nation) VALUES ("{username}", "{name}", "{age}", "{nation}")'
#             print(sql)
#             cursor.execute(sql)

#     # connection is not autocommit by default. So you must commit to save
#     # your changes.
#     connection.commit()

In [40]:
import pymysql.cursors

# Connect to the database
connection = pymysql.connect(host='localhost',
                             user='root',
                             password='',
                             database='test',
                             cursorclass=pymysql.cursors.DictCursor)

with connection:

    with connection.cursor() as cursor:
        # Read a single record
        sql = "SELECT name FROM users"
        cursor.execute(sql)
#         result = cursor.fetchone() # FETCH ONE VALUE ONLY
        result = cursor.fetchmany(3)# FETCH MANY VALUES AT A TIME
        print(result)

[{'name': 'John'}, {'name': 'Ahmed'}, {'name': 'Miller'}]

In [30]:
names = ["x", "y", "z"]
ages = [20, 32, 29]
usernames = ["x1", "x2", "x3"]
nations = ["NG", "US", "AU"]

In [32]:
list(zip(names, ages, usernames, nations))

[('x', 20, 'x1', 'NG'), ('y', 32, 'x2', 'US'), ('z', 29, 'x3', 'AU')]

In [37]:
import pymysql.cursors

def write_to_db(username, name, age, nation):

    # Connect to the database
    connection = pymysql.connect(host='localhost',
                                 user='root',
                                 password='',
                                 database='test',
                                 cursorclass=pymysql.cursors.DictCursor)

    with connection:
        with connection.cursor() as cursor:

            # Create a new record
            sql = f'INSERT INTO `users` (username, name, age, nation) VALUES ("{username}", "{name}", "{age}", "{nation}")'
            print(sql)
            cursor.execute(sql) # EXECUTE COMMAND

        # connection is not autocommit by default. So you must commit to save
        # your changes.
        connection.commit()

In [39]:
for  name, age, username, nation in zip(names, ages, usernames, nations): # LOOP THROUGH ZIPPED ITEMS ( REMEMBER ZIP() MAKES THE ITEMS INTO A MATCHED TUPLE FOR EACH LIST ENTRY)
    
    print(name, username, age, nation)
    write_to_db(username, name, age, nation) # CALL THE WRITE FUNCTION TO TAKE THE PARAMETERS, COSTRUCT OUR COMMAND AND THEN WRITE THE DATA INTO OUR DATABASE.

x x1 20 NG
INSERT INTO `users` (username, name, age, nation) VALUES ("x1", "x", "20", "NG")
y x2 32 US
INSERT INTO `users` (username, name, age, nation) VALUES ("x2", "y", "32", "US")
z x3 29 AU
INSERT INTO `users` (username, name, age, nation) VALUES ("x3", "z", "29", "AU")

In [49]:
import pandas as pd

data = pd.read_csv(r"C:\Users\kboys\OneDrive\Desktop\CLASSES\UNIVELCITY CLASSES\cohort4b1wknd\materials\statement2.csv")

In [50]:
data

,Txn Date,Date,Ref No,Withdrawls,Lodgements,Balance,Description,Unnamed: 7,Unnamed: 8
0,NaN,NaN,NaN,0.00,0.0,989693.06,Balance Brought Forward,NaN,NaN
1,31/03/2021,01/04/2021,071ICEDNGN 00001,3.43,0.0,989689.63,DEBIT INTEREST CAPITALIZATION,NaN,NaN
2,01/04/2021,01/04/2021,099MJKL210915zGn,500.00,0.0,989189.63,901Airtime- 2348031346306,NaN,NaN
3,01/04/2021,01/04/2021,099MNIP210913g7i,0.00,132600.0,1121789.63,UNIVEL CITY ENTERPRISES/March consultancy fees,NaN,NaN
4,01/04/2021,01/04/2021,099MJKL21091AlBH,100.00,0.0,1121689.63,901Airtime- 2348031346306,NaN,NaN
...,...,...,...,...,...,...,...,...,...
79,23/04/2021,23/04/2021,099MNIP211130d0Z,0.00,50000.0,955244.15,etim John/FT IFO etim BO etim K,NaN,NaN
80,23/04/2021,23/04/2021,099MJKL211132hdR,10026.88,0.0,945217.27,TRF/Refund/FRM John etim TO ISONG,NaN,NaN
81,23/04/2021,23/04/2021,099MJKL211132lwd,10026.88,0.0,935190.39,TRF/Upkeep/FRM John etim TO,NaN,NaN
82,23/04/2021,23/04/2021,099MJKL211134GVZ,30026.88,0.0,905163.51,TRF/Contribution/FRM John etim TO,NaN,NaN
83,23/04/2021,23/04/2021,099MNIP211133U7o,0.00,40000.0,945163.51,WILLIAMS OLAOLU OLUFEMIWILLIAMS OLAOLU,NaN,NaN

In [51]:
data.describe() # statistical info on dataset

          Withdrawls     Lodgements       Balance  Unnamed: 7  Unnamed: 8
count      84.000000      84.000000  8.400000e+01         0.0         0.0
mean     9484.005119    8953.891429  9.641454e+05         NaN         NaN
std     19613.207998   24528.794149  5.572199e+04         NaN         NaN
min         0.000000       0.000000  9.051635e+05         NaN         NaN
25%        40.875000       0.000000  9.196711e+05         NaN         NaN
50%      1010.750000       0.000000  9.482382e+05         NaN         NaN
75%     10026.880000       0.000000  9.930072e+05         NaN         NaN
max    100053.750000  132600.000000  1.121790e+06         NaN         NaN

In [55]:
summary = data.describe()
summary.to_excel(r"C:\Users\kboys\OneDrive\Desktop\summary.xls")

In [67]:
# for row in data.iterrows(): # loop through rows of pandas dataframe
#     print(row) # All row data

In [71]:
# for index, row in data.iterrows(): # loop through rows of pandas dataframe
# #     print(row) # All row data

    
#     print(row["Txn Date"]) # specific column (txn date)

In [80]:
import pymysql.cursors

"""CREATE TABLE statment (
  						id INT(3) AUTO_INCREMENT PRIMARY KEY NOT NULL, 
                       	txndate VARCHAR(500), 
                       	ref VARCHAR(500), 
                       	credit INT(10), 
                       	debit INT(10),  
                       	balance INT(10), 
                       	remark VARCHAR(500)
                      )"""

def write_to_db2(date, ref, debits, credits, balance, remark):

    # Connect to the database
    connection = pymysql.connect(host='localhost',
                                 user='root',
                                 password='',
                                 database='test',
                                 cursorclass=pymysql.cursors.DictCursor)

    with connection:
        with connection.cursor() as cursor:

            # Create a new record
            sql = f'INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("{date}", "{ref}", "{debits}", "{credits}", "{balance[0]}", "{remark}")'
            print(sql)
            cursor.execute(sql) # EXECUTE COMMAND

        # connection is not autocommit by default. So you must commit to save
        # your changes.
        connection.commit()

In [81]:
for index, row in data.iterrows(): # loop through rows of pandas dataframe

    date = row['Txn Date']
    ref = row['Ref No']
    debits = row['Withdrawls']
    credits = row['Lodgements']
    balance = row['Balance'],
    remark = row['Description']
    
    write_to_db2(date, ref, debits, credits, balance, remark)

INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("nan", "nan", "0.0", "0.0", "989693.06", "Balance Brought Forward")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("31/03/2021", "071ICEDNGN 00001", "3.43", "0.0", "989689.63", "DEBIT INTEREST  CAPITALIZATION")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("01/04/2021", "099MJKL210915zGn", "500.0", "0.0", "989189.63", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("01/04/2021", "099MNIP210913g7i", "0.0", "132600.0", "1121789.63", "UNIVEL CITY ENTERPRISES/March consultancy fees")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("01/04/2021", "099MJKL21091AlBH", "100.0", "0.0", "1121689.63", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("01/04/2021", "099MJKL21091AwJG", "30026.88", "0.0", "1091662.75", "TRF/savings/FRM John  etim TO etim")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("01/04/2021", "099MJKL21091AyRa", "10026.88", "0.0", "1081635.87", "TRF/refund/FRM John  etim TO ISONG")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("02/04/2021", "099MJKL210926K2P", "15026.88", "0.0", "1066608.99", "USSD_NIP/John  etim/07XXXX9839/etim ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("02/04/2021", "099MJKL210928ZCo", "500.0", "0.0", "1066108.99", "901 Data purchase/ ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("02/04/2021", "099MJKL210928Y23", "0.0", "500.0", "1066608.99", "REV-901 Data purchase/ ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL2109551Af", "22000.0", "0.0", "1044608.99", "TRF/phone repair/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL210956KcG", "7026.88", "0.0", "1037582.11", "TRF/new shoes/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL210956Kq5", "0.0", "7026.88", "1044608.99", "RVSL~TRF/new shoes/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL210956NvH", "10026.88", "0.0", "1034582.11", "TRF/shoes/FRM John  etim TO etim")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL210957ND5", "24026.88", "0.0", "1010555.23", "TRF/cloths/FRM John  etim TO OBINNA")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL21095C4ZT", "100053.75", "0.0", "910501.48", "TRF/Loan omolola/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL21095Md5g", "2010.75", "0.0", "908490.73", "TRF/Uber ride landmark/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099ZTRF21095LCTX", "0.0", "20000.0", "928490.73", "Principal Disbursement 099ILAT21095096K ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099ZTRF21095LCU2", "15.0", "0.0", "928475.73", "VAT on Management Fee 099ILAT21095096K ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099ZTRF21095LCU0", "200.0", "0.0", "928275.73", "Management Fee 099ILAT21095096K ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099ZTRF21095LCTY", "100.0", "0.0", "928175.73", "Credit Life Insurance  099ILAT21095096K ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL21095SR2e", "5010.75", "0.0", "923164.98", "TRF/Trip/FRM John  etim TO Runo Eferigho- ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("05/04/2021", "099MJKL21095cQLn", "17026.88", "0.0", "906138.1", "TRF/Refund to eddy/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("06/04/2021", "099MJKL21096BbwM", "610.75", "0.0", "905527.35", "TRF/data/FRM John  etim TO John")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("06/04/2021", "099MNIP210965hzl", "0.0", "80000.0", "985527.35", "SULIAT   YUSUFF/NIP TFR FROM SULIAT   YUSUFF")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("06/04/2021", "099MNIP210966K4v", "0.0", "15000.0", "1000527.35", "WILLIAMS  OLAOLU OLUFEMIWILLIAMS OLAOLU ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("07/04/2021", "099MJKL21096JOmW", "10026.88", "0.0", "990500.47", "TRF/Plantain flour/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("07/04/2021", "099MNIP2109707co", "0.0", "20000.0", "1010500.47", "SULIAT   YUSUFF/NIP TFR FROM SULIAT   YUSUFF")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("07/04/2021", "099MJKL21097Fjlf", "40026.88", "0.0", "970473.59", "TRF/Solar panel/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("07/04/2021", "099MJKL21097G51r", "2010.75", "0.0", "968462.84", "TRF/Eka gift/FRM John  etim TO ASUQUO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("07/04/2021", "071ZSTM21097007D", "150.0", "0.0", "968312.84", "FGN ELECTRONIC MONEY TRANSFER LEVY")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("08/04/2021", "099MJKL21098HFkL", "7026.88", "0.0", "961285.96", "TRF/Solar panel balance/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("08/04/2021", "099MJKL21098HLdb", "10026.88", "0.0", "951259.08", "TRF/Loan/FRM John  etim TO SHADE ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("09/04/2021", "099MNIP210995AoI", "0.0", "39000.0", "990259.08", "etim John AUGUSTINE/ONB TRF FROM ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("09/04/2021", "099MJKL21099FHrq", "80053.75", "0.0", "910205.33", "TRF/Inini/FRM John  etim TO AGUNBIADE  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MNIP211020SAx", "0.0", "20000.0", "930205.33", "NAGU ISAAC ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MNIP211021OLT", "0.0", "10000.0", "940205.33", "TECHBRIDGE CONSULTING LIMITED/COB TRF FROM ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL211021lP9", "5010.75", "0.0", "935194.58", "TRF/Upkeep/FRM John  etim TO  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102BELc", "2660.75", "0.0", "932533.83", "USSD_NIP/John  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102E5FV", "2510.75", "0.0", "930023.08", "TRF/tunji oladej gift/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102Eg93", "10026.88", "0.0", "919996.2", "TRF/drug and soup/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102KM01", "6026.88", "0.0", "913969.32", "TRF/Savings/FRM John  etim TO  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102OqK5", "1010.75", "0.0", "912958.57", "TRF/data n calls/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("12/04/2021", "099MJKL21102obHZ", "1010.75", "0.0", "911947.82", "TRF/Data n airtime/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "099ZTRF211031JTX", "0.0", "60000.0", "971947.82", "Principal Disbursement 099ILAT21103003S ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "099ZTRF211031JU2", "45.0", "0.0", "971902.82", "VAT on Management Fee 099ILAT21103003S ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "099ZTRF211031JU0", "600.0", "0.0", "971302.82", "Management Fee 099ILAT21103003S ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "099ZTRF211031JTY", "300.0", "0.0", "971002.82", "Credit Life Insurance  099ILAT21103003S ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "099MJKL211031Iu7", "40026.88", "0.0", "930975.94", "TRF/Car repairs/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("13/04/2021", "071ZSTM2110300DV", "50.0", "0.0", "930925.94", "FGN ELECTRONIC MONEY TRANSFER LEVY")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("14/04/2021", "099MJKL21104CoJa", "10026.88", "0.0", "920899.06", "TRF/Car fix oil/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099MJKL211051fMB", "1010.75", "0.0", "919888.31", "TRF/Data and airtime/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099ZTRF2110523L7", "0.0", "38000.0", "957888.31", "Principal Disbursement 099ILAT21105041C ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099ZTRF2110523LC", "28.5", "0.0", "957859.81", "VAT on Management Fee 099ILAT21105041C ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099ZTRF2110523LA", "380.0", "0.0", "957479.81", "Management Fee 099ILAT21105041C ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099ZTRF2110523L8", "190.0", "0.0", "957289.81", "Credit Life Insurance  099ILAT21105041C ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099MJKL211052hAj", "50026.88", "0.0", "907262.93", "TRF/Refund/FRM John  etim TO ISONG ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("15/04/2021", "099MNIP211054Pgb", "0.0", "125000.0", "1032262.93", "WILLIAMS  OLAOLU OLUFEMIWILLIAMS OLAOLU ")

INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL211060BJ4", "1010.75", "0.0", "1031252.18", "TRF/data/FRM John  etim TO John")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL211061NCG", "10026.88", "0.0", "1021225.3", "TRF/upkeep/FRM John  etim TO etim")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL211066WC9", "10026.88", "0.0", "1011198.42", "TRF/Frontend/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL211068cug", "5010.75", "0.0", "1006187.67", "TRF/Car balance/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL21106APgb", "37026.88", "0.0", "969160.79", "TRF/Chair and table/FRM John  etim TO  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MNIP211063wHT", "0.0", "60000.0", "1029160.79", "etim John/TRF IFO etim K BO etim ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL21106H0MN", "3010.75", "0.0", "1026150.04", "TRF/Balance car/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "099MJKL21106H5yh", "100053.75", "0.0", "926096.29", "TRF/balance wyre/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("16/04/2021", "071ZSTM21106000K", "50.0", "0.0", "926046.29", "FGN ELECTRONIC MONEY TRANSFER LEVY")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109D6GD", "7026.88", "0.0", "919019.41", "USSD_NIP/John  etim/07XXXX9839/etim ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109IR4o", "1010.75", "0.0", "918008.66", "TRF/data and airtime/FRM John  etim TO ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109QP2H", "7026.88", "0.0", "910981.78", "USSD_NIP/John  etim/07XXXX9839/etim ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109R1Z0", "4010.75", "0.0", "906971.03", "USSD_NIP/John  etim/07XXXX9839/etim ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109t3Dg", "0.0", "35000.0", "941971.03", "olaolu")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("19/04/2021", "099MJKL21109t4Ez", "35026.88", "0.0", "906944.15", "TRF/Olaolu/FRM John  etim TO WILLIAMS ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("20/04/2021", "099MJKL21109uN0V", "500.0", "0.0", "906444.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("20/04/2021", "099MJKL21109uI7D", "100.0", "0.0", "906344.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("20/04/2021", "099MJKL21109uI1V", "400.0", "0.0", "905944.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("20/04/2021", "099MJKL21110BrPw", "500.0", "0.0", "905444.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("20/04/2021", "099MJKL21110FTD6", "100.0", "0.0", "905344.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("22/04/2021", "099MJKL211124vNy", "100.0", "0.0", "905244.15", "901Airtime- 2348031346306 ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("23/04/2021", "099MNIP211130d0Z", "0.0", "50000.0", "955244.15", "etim John/FT IFO etim BO etim K")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("23/04/2021", "099MJKL211132hdR", "10026.88", "0.0", "945217.27", "TRF/Refund/FRM John  etim TO ISONG ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("23/04/2021", "099MJKL211132lwd", "10026.88", "0.0", "935190.39", "TRF/Upkeep/FRM John  etim TO  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("23/04/2021", "099MJKL211134GVZ", "30026.88", "0.0", "905163.51", "TRF/Contribution/FRM John  etim TO  ")
INSERT INTO `statment` (txndate , ref, debit, credit, balance, remark) VALUES ("23/04/2021", "099MNIP211133U7o", "0.0", "40000.0", "945163.51", "WILLIAMS  OLAOLU OLUFEMIWILLIAMS OLAOLU ")

In [69]:
data.columns # THIS RETURNS ALL COLUMN NAMES IN DATAFRAME

Index(['Txn Date', 'Date', 'Ref No', 'Withdrawls', 'Lodgements', 'Balance',
       'Description', 'Unnamed: 7', 'Unnamed: 8'],
      dtype='object')